import { Injectable } from '@angular/core';

@Injectable({ providedIn: 'root' })
export class StaticDataService {
  getYears() {
    return [
      { value: 'Select Year' },
      { value: '2019-2020' },
      { value: '2020-2021' },
    ];
  }

  getCycles() {
    return [
      { value: 'All' },
      { value: 'SA1' },
      { value: 'SA2' },
    ];
  }

  getApproveEntities() {
    return [
      { value: 'تعديلات لغوية / صياغة', name: 'تعديلات لغوية / صياغة' },
      { value: 'تم تعديل الرد من قبل الدائرة بعد مراجعة الشؤون الحكومية والبرلمانية', name: 'تم تعديل الرد من قبل الدائرة بعد مراجعة الشؤون الحكومية والبرلمانية' },
      { value: 'تم تعديل الرد بطلب من الدائرة', name: 'تم تعديل الرد بطلب من الدائرة' },
      { value: 'تم تعديل الرد بناء على طلب الإدارة العليا', name: 'تم تعديل الرد بناء على طلب الإدارة العليا' },
      { value: 'تم تعديل الرد بموجب اجتماع مجلس الإدارة', name: 'تم تعديل الرد بموجب اجتماع مجلس الإدارة' },
      { value: 'تم تعديل الرد بموجب اجتماع اللجنة والديوان', name: 'تم تعديل الرد بموجب اجتماع اللجنة والديوان' },
      { value: 'تم تعديل الرد بموجب اجتماع الإدارة العليا واللجنة', name: 'تم تعديل الرد بموجب اجتماع الإدارة العليا واللجنة' },
      { value: 'تم تعديل الرد حسب طلب الديوان', name: 'تم تعديل الرد حسب طلب الديوان' },
      { value: 'Other', name: 'Other' },
    ];
  }

  getDateStrings() {
    return [
      { date: 'متباين الرأى بشأنها' },
      { date: 'تتعلق بجهات حكومية/اخرى' },
      { date: 'تم الانتهاء من إجراءاتها' },
    ];
  }
}
